============
Line comment
============

// some text

---

(source_file
  (line_comment))

=============
Block comment
=============

/* some text */

---

(source_file
  (block_comment))

======================
Line comment in object
======================

Box {
  // some text
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (line_comment))))

=======================
Block comment in object
=======================

Box {
  /* some text */
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (block_comment))))

===========================
Line comment after property
===========================

Box {
  title: "title"; // some text
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (property
        name: (ident)
	value: (value
	  (literal
	    (quoted))))
      (line_comment))))

============================
Block comment after property
============================

Box {
  title: "title"; /* some text */
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (property
        name: (ident)
	value: (value
	  (literal
	    (quoted))))
      (block_comment))))

=============================
Block comment before property
=============================

Box {
  /* some text */ title: "title";
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (block_comment)
      (property
        name: (ident)
	value: (value
	  (literal
	    (quoted)))))))

============================
Line comment before property
============================

Box {
  // some text title: "title";
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (line_comment))))

=========================
Asterisk in block comment
=========================

/* * */

---

(source_file
  (block_comment))

===============================
Slash asterisk in block comment
===============================

/* /* */

---

(source_file
  (block_comment))
