=========================
String with single quotes
=========================

Box {
  title: 'some value';
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (property
        name: (ident)
        value: (value
          (literal
            (quoted)))))))

=========================
String with double quotes
=========================

Box {
  title: "some value";
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (property
        name: (ident)
        value: (value
          (literal
            (quoted)))))))

=================================
String with escaped single quotes
=================================

Box {
  title: 'some \'value';
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (property
        name: (ident)
        value: (value
          (literal
            (quoted
              (escape_sequence))))))))

=================================
String with escaped double quotes
=================================

Box {
  title: "some \"value";
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (property
        name: (ident)
        value: (value
          (literal
            (quoted
              (escape_sequence))))))))

================
Multiline string
================

Box {
  a: "line 1\
line 2";
}

---

(source_file
  (object
    name: (type_name
      name: (ident))
    content: (object_content
      (property
        name: (ident)
        value: (value
          (literal
            (quoted
              (escape_sequence))))))))

====================================
Single quote in double quoted string
====================================

Button {
  label: "Let's Start";
}

---

(source_file
  (object
    (type_name
      (ident))
    (object_content
      (property
        (ident)
        (value
          (literal
            (quoted)))))))

=================
Escaped backslash
=================

Button {
  label: "\\";
}

---

(source_file
  (object
    (type_name
      (ident))
    (object_content
      (property
        (ident)
        (value
          (literal
            (quoted
              (escape_sequence))))))))

=======================
Newline escape sequence
=======================

Button {
  label: "\n";
}

---

(source_file
  (object
    (type_name
      (ident))
    (object_content
      (property
        (ident)
        (value
          (literal
            (quoted
              (escape_sequence))))))))

===================
Tab escape sequence
===================

Button {
  label: "\t";
}

---

(source_file
  (object
    (type_name
      (ident))
    (object_content
      (property
        (ident)
        (value
          (literal
            (quoted
              (escape_sequence))))))))
